root643/unsolo-key/ch32fun/minichlink/minichlink.c
// The rest of the code, Copyright 2023 Charles Lohr
// Freely licensable under the MIT/x11, NewBSD Licenses, or
// public domain where applicable. 

// TODO: Can we make a unified DMPROG for reading + writing?

#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include <getopt.h>
#include "cmdserver.h"
#include "terminalhelp.h"
#include "minichlink.h"
#include "../ch32fun/ch32fun.h"
#include "chips.h"
#include "ch5xx.h"

#if defined(WINDOWS) || defined(WIN32) || defined(_WIN32)
extern int isatty(int);
#if !defined(_SYNCHAPI_H_) && !defined(__TINYC__)
void Sleep(uint32_t dwMilliseconds);
#endif
#else
#include <pwd.h>
#include <unistd.h>
#include <grp.h>
#endif

static int64_t StringToMemoryAddress( void * dev, const char * number ) __attribute__((used));
static void StaticUpdatePROGBUFRegs( void * dev ) __attribute__((used));
int DefaultReadBinaryBlob( void * dev, uint32_t address_to_read_from, uint32_t read_size, uint8_t * blob );
int DefaultDelayUS( void * dev, int us );
void PostSetupConfigureInterface( void * dev );
int DefaultConfigureReadProtection( void * dev, int one_if_yes_protect );
void TestFunction(void * v );
static void readCSR( void * dev, uint32_t csr );
static int DefaultRebootIntoBootloader( void * dev );
struct MiniChlinkFunctions MCF;

void * MiniCHLinkInitAsDLL( struct MiniChlinkFunctions ** MCFO, const init_hints_t* init_hints )
{
	void * dev = 0;
	
#ifdef VERSION
	char * version = VERSION;
	fprintf(stderr, "minichlink version - %s\n", version);
#endif
	const char * specpgm = init_hints->specific_programmer;
	if( specpgm )
	{
		if( strcmp( specpgm, "linke" ) == 0 )
			dev = TryInit_WCHLinkE(init_hints);
		else if( strcmp( specpgm, "isp" ) == 0 )
			dev = TryInit_WCHISP();
		else if( !strcmp( specpgm, "esp32s2chfun" ) || !strcmp( specpgm, "funprog" ) )
			dev = TryInit_ESP32S2CHFUN(SimpleReadNumberInt(init_hints->serial_port, 0x12065d10));
		else if( strcmp( specpgm, "nchlink" ) == 0 )
			dev = TryInit_NHCLink042();
		else if( strcmp( specpgm, "b003boot" ) == 0 )
			dev = TryInit_B003Fun(SimpleReadNumberInt(init_hints->serial_port, 0x1209b003));
		else if( strcmp( specpgm, "ardulink" ) == 0 )
			dev = TryInit_Ardulink(init_hints);
	}
	else
	{
		if( (dev = TryInit_WCHISP()) )
		{
			fprintf( stderr, "Found MCU in bootloader mode\n" );
		}
		else if( (dev = TryInit_WCHLinkE(init_hints)) )
		{
			fprintf( stderr, "Found WCH Link\n" );
		}
		else if( (dev = TryInit_ESP32S2CHFUN(SimpleReadNumberInt(init_hints->serial_port, 0x12065d10))) )
		{
			// Will print the exact programmer type in init
			// fprintf( stderr, "Found ESP32S2-Style Programmer\n" );
		}
		else if ((dev = TryInit_NHCLink042()))
		{
			fprintf( stderr, "Found NHC-Link042 Programmer\n" );
		}
		else if ((dev = TryInit_B003Fun(SimpleReadNumberInt(init_hints->serial_port, 0x1209b003))))
		{
			fprintf( stderr, "Found B003Fun Bootloader\n" );
		}
		else if ( init_hints->serial_port && strncmp( init_hints->serial_port, "0x", 2 ) && (dev = TryInit_Ardulink(init_hints)))
		{
			fprintf( stderr, "Found Ardulink Programmer\n" );
		}
	}

	if( !dev )
	{
		if ( specpgm )
		{
			fprintf( stderr, "Error: Could not initialize %s programmer\n", specpgm );
		} else
		{
			fprintf( stderr, "Error: Could not initialize any supported programmers\n" );
		}
		return 0;
	}

	struct InternalState * iss = calloc( 1, sizeof( struct InternalState ) );
	((struct ProgrammerStructBase*)dev)->internal = iss;
	iss->ram_base = 0x20000000;
	iss->ram_size = 2048;
	iss->sector_size = 64;
	iss->target_chip = NULL;
	iss->target_chip_type = 0;

	SetupAutomaticHighLevelFunctions( dev );

	if( MCFO )
	{
		*MCFO = &MCF;
	}
	return dev;
}

#if !defined( MINICHLINK_AS_LIBRARY ) && !defined( MINICHLINK_IMPORT )
int main( int argc, char ** argv )
{
	int i;

	if( argc > 1 && argv[1][0] == '-' && argv[1][1] == 'h' )
	{
		goto help;
	}
	init_hints_t hints;
	memset(&hints, 0, sizeof(hints));

	// Scan for possible hints.
	for( i = 0; i < argc; i++ )
	{
		char * v = argv[i];
		if( strncmp( v, "-c", 2 ) == 0 )
		{
			i++;
			if( i < argc )
			{
				hints.serial_port = argv[i];
				if( strncmp( hints.serial_port, "0x", 2 ) == 0 )
				{
					hints.specific_programmer = "b003boot";
				}
			}
		}
		else if( strncmp( v, "-C", 2 ) == 0 )
		{
			i++;
			if( i < argc )
				hints.specific_programmer = argv[i];
		}
		else if( strncmp( v, "-l", 2 ) == 0 )
		{
			i++;
			if( i < argc )
				hints.programmer_serial_number = argv[i];
		}
	}

	if( !hints.programmer_serial_number )
	{
		const char * env_serial = getenv( "MINICHLINK_programmer_serial_number" );
		if( !env_serial || !env_serial[0] )
			env_serial = getenv( "MINICHLINK_LINKE_SERIAL" );
		if( env_serial && env_serial[0] )
			hints.programmer_serial_number = env_serial;
	}

#if !defined(WINDOWS) && !defined(WIN32) && !defined(_WIN32) && !defined(__APPLE__)
	{
		uid_t uid = getuid();
		struct passwd* pw = getpwuid(uid);
		if( pw )
		{
			gid_t groups[512];
			int ngroups = sizeof( groups ) / sizeof( groups[0] );
			int gl = getgrouplist( pw->pw_name, pw->pw_gid, groups, &ngroups );
			int i;
			for( i = 0; i < gl; i++ )
			{
				struct group * gr = getgrgid( groups[i] );
				if( strcmp( gr->gr_name, "plugdev" ) == 0 || strcmp( gr->gr_name, "dialout" ) == 0 )
					break;
			}
			if( i == gl )
			{
				printf( "WARNING: You are not in the plugdev/dialout group, the canned udev rules will not work on your system.\n" );
			}
		}
	}
#endif

	void * dev = MiniCHLinkInitAsDLL( 0, &hints );
	if( !dev )
	{
		// fprintf( stderr, "Error: Could not initialize any supported programmers\n" );
		return -32;
	}

	int status;
	int must_be_end = 0;

	int skip_startup = 
		(argc > 1 && argv[1][0] == '-' && argv[1][1] == 'k' ) |
		(argc > 1 && argv[1][0] == '-' && argv[1][1] == 'e' ) |
		(argc > 1 && argv[1][0] == '-' && argv[1][1] == 'A' ) |
		(argc > 1 && argv[1][0] == '-' && argv[1][1] == 'u' ) |
		(argc > 1 && argv[1][0] == '-' && argv[1][1] == 'h' ) |
		(argc > 1 && argv[1][0] == '-' && argv[1][1] == 't' ) |
		(argc > 1 && argv[1][0] == '-' && argv[1][1] == 'f' ) |
		(argc > 1 && argv[1][0] == '-' && argv[1][1] == 'X' );

