root643/unsolo-key/ch32fun/minichlink/minichlink.c
	if( !skip_startup && MCF.SetupInterface )
	{
		if( MCF.SetupInterface( dev ) < 0 )
		{
			fprintf( stderr, "Could not setup interface.\n" );
			return -33;
		}
		printf( "Interface Setup\n" );
	}

	struct InternalState * iss = (struct InternalState*)(((struct ProgrammerStructBase*)dev)->internal);
	if( iss->target_chip == 0 && !skip_startup )
	{
		int ret = 1;
		if( MCF.DetermineChipType ) ret = MCF.DetermineChipType( dev );
		if( ret ) return ret;
	}

	// PostSetupConfigureInterface( dev );

	int iarg = 1;
	const char * lastcommand = 0;
	for( ; iarg < argc; iarg++ )
	{
		char * argchar = argv[iarg];

		lastcommand = argchar;
		if( argchar[0] != '-' )
		{
			fprintf( stderr, "Error: Need prefixing - before commands\n" );
			goto help;
		}
		if( must_be_end )
		{
			fprintf( stderr, "Error: the command '%c' cannot be followed by other commands.\n", must_be_end );
			return -1;
		}
		
keep_going:
		switch( argchar[1] )
		{
			default:
				fprintf( stderr, "Error: Unknown command %c\n", argchar[1] );
			case 'h':
				goto help;
			case 'k':
				printf( "Skipping programmer initialization\n" );
				iss->init_skip++;
				argchar++;
				goto keep_going;
			case '3':
				if( MCF.Control3v3 )
					MCF.Control3v3( dev, 1 );
				else
					goto unimplemented;
				break;
			case '5':
				if( MCF.Control5v )
					MCF.Control5v( dev, 1 );
				else
					goto unimplemented;
				break;
			case 't':
				if( MCF.Control3v3 )
					MCF.Control3v3( dev, 0 );
				else
					goto unimplemented;
				break;
			case 'f':
				if( MCF.Control5v )
					MCF.Control5v( dev, 0 );
				else
					goto unimplemented;
				break;
			case 'C': // For specifying programmer
			case 'c':
			case 'l': // programmer USB serial (parsed previously)
				// COM port or programmer argument already parsed previously
				// we still need to skip the next argument
				iarg+=1;
				if( iarg >= argc )
				{
					fprintf( stderr, "-c/C/-l argument required 2 arguments\n" );
					goto unimplemented;
				}
				break;
			case 'u':
				if( MCF.Unbrick )
					MCF.Unbrick( dev );
				else
					goto unimplemented;
				break;
			case 'U':
				// Unlock Bootloader
				if( InternalUnlockBootloader( dev ) )
					goto unimplemented;
				break;
			case 'b':  //reBoot
				if( !MCF.HaltMode || MCF.HaltMode( dev, HALT_MODE_REBOOT ) )
					goto unimplemented;
				break;
			case 'B':  //reBoot into Bootloader
				if( iss->target_chip_type != CHIP_CH32V003
				  && iss->target_chip_type != CHIP_CH32V00x
				  && iss->target_chip_type != CHIP_CH641
				  && iss->target_chip_type != CHIP_CH643
				  && iss->target_chip_type != CHIP_CH32X03x ) DefaultRebootIntoBootloader( dev );
				else if( !MCF.HaltMode || MCF.HaltMode( dev, HALT_MODE_GO_TO_BOOTLOADER ) )
					goto unimplemented;
				break;
			case 'e':  //rEsume
				if( !MCF.HaltMode || MCF.HaltMode( dev, HALT_MODE_RESUME ) )
					goto unimplemented;
				break;
			case 'E':  //Erase whole chip.
				if( MCF.HaltMode ) MCF.HaltMode( dev, HALT_MODE_HALT_AND_RESET );
				if( !MCF.Erase || MCF.Erase( dev, 0, 0, 1 ) )
					goto unimplemented;
				break;
			case 'a':
				if( !MCF.HaltMode || MCF.HaltMode( dev, HALT_MODE_HALT_AND_RESET ) )
					goto unimplemented;
				break;
			case 'A':  // Halt without reboot
				if( !MCF.HaltMode || MCF.HaltMode( dev, HALT_MODE_HALT_BUT_NO_RESET ) )
					goto unimplemented;
				break;

			// disable NRST pin (turn it into a GPIO)
			case 'd':  // see "RSTMODE" in datasheet
				if( MCF.HaltMode ) MCF.HaltMode( dev, HALT_MODE_HALT_AND_RESET );
				if( iss->target_chip_type == CHIP_CH32L103 ||
						iss->target_chip_type == CHIP_CH32V10x ||
						iss->target_chip_type == CHIP_CH32V20x ||
						iss->target_chip_type == CHIP_CH32V205 ||
						iss->target_chip_type == CHIP_CH32V30x ||
						iss->target_chip_type == CHIP_CH32H41x )
				{
					fprintf( stderr, "Warning. This chip can't use NRST as GPIO.\n" );
					break;
				}
				if( MCF.ConfigureNRSTAsGPIO )
					MCF.ConfigureNRSTAsGPIO( dev, 0 );
				else
					goto unimplemented;
				break;
			case 'D': // see "RSTMODE" in datasheet
				if( MCF.HaltMode ) MCF.HaltMode( dev, HALT_MODE_HALT_AND_RESET );
				if( iss->target_chip_type == CHIP_CH32L103 ||
						iss->target_chip_type == CHIP_CH32V10x ||
						iss->target_chip_type == CHIP_CH32V20x ||
						iss->target_chip_type == CHIP_CH32V205 ||
						iss->target_chip_type == CHIP_CH32V30x ||
						iss->target_chip_type == CHIP_CH32H41x )
				{
					fprintf( stderr, "ERROR. This chip can't use NRST as GPIO.\n" );
					break;
				}
				if( MCF.ConfigureNRSTAsGPIO )
					MCF.ConfigureNRSTAsGPIO( dev, 1 );
				else
					goto unimplemented;
				break;
			case 'p':
				if( MCF.HaltMode ) MCF.HaltMode( dev, HALT_MODE_HALT_AND_RESET );
				if( MCF.ConfigureReadProtection )
				{
					fprintf(stderr, "This will erase the flash entirely!\n");
					fprintf(stderr, "Auto-proceeding (patched for scripting).\n");
					// Patched: was `while(!IsKBHit());` which blocks scripted runs
					MCF.ConfigureReadProtection( dev, 0 );
				}
				else
					goto unimplemented;

				break;
			case 'P':
				if( MCF.HaltMode ) MCF.HaltMode( dev, HALT_MODE_HALT_AND_RESET );
				if( MCF.ConfigureReadProtection )
					MCF.ConfigureReadProtection( dev, 1 );
				else
					goto unimplemented;
				break;
			case 'S':  // Set FLASH/RAM split in option bytes
			{	
				if( !MCF.SetSplit )
					goto unimplemented;
				enum RAMSplit split = FLASH_DEFAULT;

				iarg+=2;
				if( iarg >= argc )
				{
					fprintf( stderr, "FLASH/RAM split requires two values: flash size and RAM size (in kb)\n" );
					goto unimplemented;
				}

				uint32_t flash_size = SimpleReadNumberInt( argv[iarg-1], 0);
				uint32_t sram_size = SimpleReadNumberInt( argv[iarg], 0 );
				
				if (flash_size == 192 && sram_size == 128) {
					split = FLASH_192_RAM_128;
				} else if (flash_size == 224 && sram_size == 96) {
					split = FLASH_224_RAM_96;
				} else if (flash_size == 256 && sram_size == 64) {
					split = FLASH_256_RAM_64;
				} else if (flash_size == 288 && sram_size == 32) {
					split = FLASH_288_RAM_32;
				} else if (flash_size == 128 && sram_size == 192) {
					split = FLASH_128_RAM_192;
				} else if (flash_size == 128 && sram_size == 64) {
					split = FLASH_128_RAM_64;
				} else if (flash_size == 144 && sram_size == 48) {
					split = FLASH_144_RAM_48;
				} else if (flash_size == 160 && sram_size == 32) {
					split = FLASH_160_RAM_32;
				} else {
					fprintf( stderr, "Unknown split: %dk FLASH / %dk RAM\n", flash_size, sram_size );
					goto unimplemented;
				}

				MCF.SetSplit(dev, split);
				break;
			}
			case 'G':
			case 'T':
			{
				if( !MCF.PollTerminal )
					goto unimplemented;

