root643/unsolo-key/ch32fun/minichlink/minichlink.c
				printf( "\nImage written.\n" );

				free( image );
				break;
			}
			case 'N':
			{
				if( MCF.EnableDebug )
				{
					printf("Enabling debug\n");
					if( MCF.EnableDebug( dev, 0 ) )
					{
						return -13;
					}
				}
				break;
			}
			case 'n':
			{
				if( MCF.EnableDebug )
				{
					fprintf( stderr, "This will disable debug module. And you will be only able to program the chip using the bootloader.\nPress Enter to continue\n");
					while(!IsKBHit());
					ReadKBByte();
					fprintf( stderr, "Are you absolutely sure about it?\nPress Enter to continue, or Ctrl+C to cancel\n");
					while(!IsKBHit());
					if( MCF.EnableDebug( dev, 1 ) )
					{
						return -13;
					}
				}
				break;
			}
			case 'Y':
			{
				if( iss->target_chip_type == CHIP_CH570 ||
					  iss->target_chip_type == CHIP_CH57x ||
					  iss->target_chip_type == CHIP_CH58x ||
					  iss->target_chip_type == CHIP_CH585 ||
					  iss->target_chip_type == CHIP_CH59x) CH5xxBlink(dev, 0, 8, 0);
				break;
			}
				
			case 'y':
			{
				readCSR( dev, 0x300 );
				break;
			}
			
		}
		if( argchar && argchar[2] != 0 ) { argchar++; goto keep_going; }
	}

	if( MCF.FlushLLCommands )
		MCF.FlushLLCommands( dev );

	if( MCF.Exit && !skip_startup )
		MCF.Exit( dev );

	return 0;

help:
	fprintf( stderr, "Usage: minichlink [args]\n" );
	fprintf( stderr, " single-letter args may be combined, i.e. -3r\n" );
	fprintf( stderr, " multi-part args cannot.\n" );
	fprintf( stderr, " -3 Enable 3.3V\n" );
	fprintf( stderr, " -5 Enable 5V\n" );
	fprintf( stderr, " -t Disable 3.3V\n" );
	fprintf( stderr, " -f Disable 5V\n" );
	fprintf( stderr, " -k Skip programmer initialization\n" );
	fprintf( stderr, " -c [serial port for Ardulink, try /dev/ttyACM0 or COM11 etc] or [VID+PID of USB for b003boot, try 0x1209b003]\n" );
	fprintf( stderr, " -C [specified programmer, eg. b003boot, ardulink, esp32s2chfun, funprog, isp, linke]\n" );
	fprintf( stderr, " -l [programmer USB serial; omit for default device selection]\n" );
	fprintf( stderr, " -u Clear all code flash - by power off (also can unbrick)\n" );
	fprintf( stderr, " -a Reboot into Halt\n" );
	fprintf( stderr, " -A Go into Halt without reboot\n" );
	fprintf( stderr, " -b Reboot out of Halt\n" );
	fprintf( stderr, " -B Reboot into BOOTLOADER and halt\n" );
	fprintf( stderr, " -e Resume from halt\n" );
	fprintf( stderr, " -E Erase chip\n" );
	fprintf( stderr, " -D Configure NRST as GPIO\n" );
	fprintf( stderr, " -d Configure NRST as NRST\n" );
	fprintf( stderr, " -i Show chip info\n" );
	fprintf( stderr, " -s [debug register] [value]\n" );
	fprintf( stderr, " -m [debug register]\n" );
	fprintf( stderr, " -T Terminal Only (must be last arg)\n" );
	fprintf( stderr, " -G Terminal + GDB (must be last arg)\n" );
	fprintf( stderr, " -P Enable Read Protection\n" );
	fprintf( stderr, " -p Disable Read Protection\n" );
	fprintf( stderr, " -N Enable Debug Module\n" );
	fprintf( stderr, " -n Disable Debug Module\n" );
	fprintf( stderr, " -S set FLASH/SRAM split [FLASH kbytes] [SRAM kbytes]\n" );
	fprintf( stderr, " -w [binary image to write] [address, decimal or 0x, try0x08000000]\n" );
	fprintf( stderr, " -r [output binary image] [memory address, decimal or 0x, try 0x08000000] [size, decimal or 0x, try 16384]\n" );
	fprintf( stderr, "   Note: for memory addresses, you can use 'flash' 'bootloader' 'option' 'eeprom' 'ram' and say \"ram+0x10\" for instance\n" );
	fprintf( stderr, "   For filename, you can use - for raw (terminal) or + for hex (inline).\n" );
	fprintf( stderr, " -X [programmer-specific command, for esp32-s2 programmer, -X ECLK:1:0:0:8:3 for 24MHz clock out]\n" );

	return -1;	

unimplemented:
	fprintf( stderr, "Error: Command '%s' unimplemented on this programmer.\n", lastcommand );
	return -1;
}
#endif

#if defined(WINDOWS) || defined(WIN32) || defined(_WIN32)
#define strtoll _strtoi64
#endif

int64_t SimpleReadNumberInt( const char * number, int64_t defaultNumber )
{
	if( !number || !number[0] ) return defaultNumber;
	int radix = 10;
	if( number[0] == '0' )
	{
		char nc = number[1];
		number+=2;
		if( nc == 0 ) return 0;
		else if( nc == 'x' ) radix = 16;
		else if( nc == 'b' ) radix = 2;
		else { number--; radix = 8; }
	}
	char * endptr;
	uint64_t ret = strtoll( number, &endptr, radix );
	if( endptr == number )
	{
		return defaultNumber;
	}
	else
	{
		return ret;
	}
}

static int64_t StringToMemoryAddress( void * dev, const char * number )
{
	struct InternalState * iss = (struct InternalState*)(((struct ProgrammerStructBase*)dev)->internal);
	uint32_t base = 0xFFFFFFFF;

	if( strncmp( number, "flash", 5 ) == 0 )
	{
		base = iss->target_chip->flash_offset;
		number += 5;
		iss->current_area = PROGRAM_AREA;
	}
	if( strncmp( number, "launcher", 8 ) == 0 )
	{
		base = iss->target_chip->bootloader_offset;
		number += 8;
		iss->current_area = BOOTLOADER_AREA;
	}    
	if( strncmp( number, "bootloader", 10 ) == 0 )
	{
		base = iss->target_chip->bootloader_offset;
		number += 10;
		iss->current_area = BOOTLOADER_AREA;
	}
	if( strncmp( number, "option", 6 ) == 0 )
	{
		base = iss->target_chip->options_offset;
		number += 6;
		iss->current_area = OPTIONS_AREA;
	}
	if( strncmp( number, "options", 7 ) == 0 )
	{
		base = iss->target_chip->options_offset;
		number += 7;
		iss->current_area = OPTIONS_AREA;
	}
	if( strncmp( number, "user", 4 ) == 0 )
	{
		base = iss->target_chip->options_offset;
		number += 4;
		iss->current_area = OPTIONS_AREA;
	}
	if( strncmp( number, "eeprom", 6 ) == 0 )
	{
		base = iss->target_chip->eeprom_offset;
		number += 6;
		iss->current_area = EEPROM_AREA;
	}
	if( strncmp( number, "ram", 3 ) == 0 )
	{
		base = iss->target_chip->ram_base;
		number += 3;
		iss->current_area = RAM_AREA;
	}

	if( base != 0xFFFFFFFF )
	{
		if( *number != '+' )
			return base;
		number++;
		return base + SimpleReadNumberInt( number, 0 );
	}
	return SimpleReadNumberInt( number, -1 );
}

static int DefaultWaitForFlash( void * dev )
{
	uint32_t rw, timeout = 0;
	do
	{
		rw = 0;
		MCF.ReadWord( dev, (intptr_t)&FLASH->STATR, &rw ); // FLASH_STATR => 0x4002200C
		if( timeout++ > 1000 )
		{
			fprintf( stderr, "Warning: Flash timed out. STATR = %08x\n", rw );
			return -1;
		}
	} while(rw & 3);  // BSY flag for 003, or WRBSY for other processors.

	// This was set at some point for non-003 processors.
	// but, it seems not to be needed.
	// if( rw & 0x20 )
	// {
	// 	// On non-003-processors, clear done op.
	// 	MCF.WriteWord( dev, (intptr_t)&FLASH->STATR, 0x20 );
	// }

	if( rw & FLASH_STATR_WRPRTERR )
	{
		fprintf( stderr, "Memory Protection Error\n" );
		return -44;
	}

