root643/unsolo-key/ch32fun/minichlink/minichlink.c
	return 0;
}

static int DefaultWaitForDoneOp( void * dev, int ignore )
{
	int r;
	uint32_t rrv;
	int timeout = 100;

	do
	{
		r = MCF.ReadReg32( dev, DMABSTRACTCS, &rrv );
		if( r ) return r;
	}
	while( (rrv & (1<<12)) && timeout-- );

	if( ((rrv >> 8 ) & 7) || (rrv & (1<<12)) )
	{
		if( !ignore )
		{
			const char * errortext = 0;
			switch( (rrv>>8)&7 )
			{
			case 1: errortext = "Command in execution"; break;
			case 2: errortext = "Abstract Command Unsupported"; break;
			case 3: errortext = "Exception executing Abstract Command"; break;
			case 4: errortext = "Processor not halted."; break;
			case 5: errortext = "Bus Error"; break;
			case 6: errortext = "Parity Bit"; break;
			default: errortext = "Other Error"; break;
			}

			uint32_t temp;
			MCF.ReadReg32( dev, DMSTATUS, &temp );
			fprintf( stderr, "Fault on op (DMABSTRACTS = %08x) (%d) (%s) DMSTATUS: %08x\n", rrv, timeout, errortext, temp );
		}
		MCF.WriteReg32( dev, DMABSTRACTCS, 0x00000700 );
		return -9;
	}
	return 0;
}

int DefaultSetupInterface( void * dev )
{
	struct InternalState * iss = (struct InternalState*)(((struct ProgrammerStructBase*)dev)->internal);
	int retries = MINICHLINK_SETUP_MAX_RETRIES;

	if( MCF.Control3v3 ) MCF.Control3v3( dev, 1 );
retry:
	MCF.DelayUS( dev, 16000 );
	MCF.WriteReg32( dev, DMSHDWCFGR, 0x5aa50000 | (1<<10) ); // Shadow Config Reg
	MCF.WriteReg32( dev, DMCFGR, 0x5aa50000 | (1<<10) ); // CFGR (1<<10 == Allow output from slave)
	MCF.WriteReg32( dev, DMSHDWCFGR, 0x5aa50000 | (1<<10) ); // sometimes doing this just once isn't enough
	MCF.WriteReg32( dev, DMCFGR, 0x5aa50000 | (1<<10) ); // And this is about as fast as checking, so why not.  
	MCF.WriteReg32( dev, DMCONTROL, 0x80000001 ); // Make the debug module work properly.
	MCF.WriteReg32( dev, DMCONTROL, 0x80000001 );
	MCF.WriteReg32( dev, DMCONTROL, 0x80000001 );
	// Why do we repeat this commands? Because in some cases they can be lost, if debug module is still starting
	// and it's better to be send these crucial commands twice fot better chance for success.

	// Read back chip status.  This is really basic.
	uint32_t reg = 0;
	int r = MCF.ReadReg32( dev, DMSTATUS, &reg );
	if( r >= 0 )
	{
		// Valid R.
		if( reg == 0x00000000 || reg == 0xffffffff )
		{
			fprintf( stderr, "Error: Setup chip failed. Got code %08x\n", reg );
			if (retries--) goto retry;
			return -9;
		}
	}
	else
	{
		fprintf( stderr, "Error: Could not read dmstatus. r = %d\n", r );
		return r;
	}

	iss->statetag = STTAG( "STRT" );
	return 0;
}

static int DefaultGetUUID( void * dev, uint8_t * buffer )
{
	struct InternalState * iss = (struct InternalState*)(((struct ProgrammerStructBase*)dev)->internal);
	int ret = 0;
	if( iss->target_chip == NULL)
	{
		ret = MCF.DetermineChipType( dev );
		if( ret ) return ret;
	}
	uint8_t local_buffer[8] = {0, 0, 0, 0, 0, 0, 0, 0};
	enum RiscVChip chip = iss->target_chip_type;

	if( iss->target_chip->protocol == PROTOCOL_DEFAULT )
	{
		MCF.WriteReg32( dev, DMABSTRACTAUTO, 0 );
		MCF.WriteReg32( dev, DMPROGBUF0, 0x90024000 ); // c.ebreak <<== c.lw x8, 0(x8)
		if( chip == CHIP_CH32M030 ) MCF.WriteReg32( dev, DMDATA0, 0x1ffff3a8 );
		else MCF.WriteReg32( dev, DMDATA0, 0x1ffff7e8 );
		MCF.WriteReg32( dev, DMCOMMAND, 0x00271008 ); // Copy data to x8, and execute.
		MCF.WaitForDoneOp( dev, 0 );
		MCF.WriteReg32( dev, DMCOMMAND, 0x00221008 ); // Copy data from x8.
		MCF.ReadReg32( dev, DMDATA0, (uint32_t*)local_buffer );
		if( chip == CHIP_CH32M030 ) MCF.WriteReg32( dev, DMDATA0, 0x1ffff3ac );
		else MCF.WriteReg32( dev, DMDATA0, 0x1ffff7ec );
		MCF.WriteReg32( dev, DMCOMMAND, 0x00271008 ); // Copy data to x8, and execute.
		MCF.WaitForDoneOp( dev, 0 );
		MCF.WriteReg32( dev, DMCOMMAND, 0x00221008 ); // Copy data from x8.
		MCF.ReadReg32( dev, DMDATA0, (uint32_t*)(local_buffer + 4) );
		*((uint32_t*)buffer) = local_buffer[0]<<24|local_buffer[1]<<16|local_buffer[2]<<8|local_buffer[3];
		*(((uint32_t*)buffer)+1) = local_buffer[4]<<24|local_buffer[5]<<16|local_buffer[6]<<8|local_buffer[7];
	}
	else if( iss->target_chip->protocol == PROTOCOL_CH5xx )
	{
		ret = CH5xxReadUUID( dev, local_buffer );
		memcpy(buffer, local_buffer, 8);
	}
	return ret;
}

static int DefaultDetermineChipType( void * dev )
{
	struct InternalState * iss = (struct InternalState*)(((struct ProgrammerStructBase*)dev)->internal);
	if( iss->target_chip == NULL )
	{
		uint32_t rr;
		if( MCF.ReadReg32( dev, DMHARTINFO, &rr ) )
		{
			fprintf( stderr, "Error: Could not get hart info.\n" );
			return -1;
		}

		MCF.WriteReg32( dev, DMCONTROL, 0x80000001 ); // Make the debug module work properly.
		MCF.WriteReg32( dev, DMCONTROL, 0x80000001 ); // Initiate halt request.

		// Tricky, this function needs to clean everything up because it may be used entering debugger.
		uint32_t old_data0;
		MCF.ReadReg32( dev, DMDATA0, &old_data0 );
		MCF.WriteReg32( dev, DMCOMMAND, 0x00221008 ); // Copy data from x8.
		uint32_t old_x8;
		MCF.ReadReg32( dev, DMDATA0, &old_x8 );

		uint32_t marchid = 0;

		MCF.WriteReg32( dev, DMABSTRACTCS, 0x08000700 ); // Clear out any dmabstractcs errors.

		MCF.WriteReg32( dev, DMABSTRACTAUTO, 0x00000000 );
		MCF.WriteReg32( dev, DMCOMMAND, 0x00220000 | 0xf12 );
		MCF.WriteReg32( dev, DMCOMMAND, 0x00220000 | 0xf12 );  // Need to double-read, not sure why.
		MCF.ReadReg32( dev, DMDATA0, &marchid );
		MCF.WriteReg32( dev, DMPROGBUF0, 0x90024000 ); // c.ebreak <<== c.lw x8, 0(x8)
		MCF.FlushLLCommands(dev);

		uint32_t chip_id = 0;
		uint32_t vendor_bytes = 0;
		uint32_t sevenf_id = 0;
		int read_protection = 0;
		MCF.ReadReg32( dev, 0x7f, &sevenf_id );

		if( sevenf_id == 0 )
		{
			// Need to load new progbuf because we're reading 1 byte now
			MCF.WriteReg32( dev, DMPROGBUF0, 0x00040403 ); // lb x8, 0(x8)
			MCF.WriteReg32( dev, DMPROGBUF1, 0x00100073 ); // c.ebreak
			MCF.WriteReg32( dev, DMDATA0, 0x40001041 ); // Special chip ID location.
			MCF.WriteReg32( dev, DMCOMMAND, 0x00271008 ); // Copy data to x8, and execute.
			MCF.WaitForDoneOp( dev, 0 );
			MCF.WriteReg32( dev, DMCOMMAND, 0x00221008 ); // Copy data from x8.
			MCF.ReadReg32( dev, DMDATA0, &chip_id );
			chip_id = chip_id & 0xff;

			// Looks like a CH32V103 or a CH56x
			if( chip_id == 0 )
			{
				// First check for CH56x
				MCF.WriteReg32( dev, DMDATA0, 0x40001001 );			
				MCF.WriteReg32( dev, DMCOMMAND, 0x00271008 ); // Copy data to x8, and execute.
				MCF.WaitForDoneOp( dev, 1 );
				MCF.WriteReg32( dev, DMCOMMAND, 0x00221008 ); // Copy data from x8.
				MCF.ReadReg32( dev, DMDATA0, &chip_id );
				MCF.WriteReg32( dev, DMDATA0, 0x40001002 ); // Special chip ID location.
				MCF.WriteReg32( dev, DMCOMMAND, 0x00271008 ); // Copy data to x8, and execute.
				MCF.WaitForDoneOp( dev, 1 );
				MCF.WriteReg32( dev, DMCOMMAND, 0x00221008 ); // Copy data from x8.
				MCF.ReadReg32( dev, DMDATA0, &vendor_bytes );

