root643/unsolo-key/ch32fun/minichlink/minichlink.c
		if( iss->target_chip == NULL)
		{
			fprintf( stderr, "Unknown chip type.  Report as bug with picture of chip.\n" );
			fprintf( stderr, "marchid : %08x\n", marchid );
			fprintf( stderr, "HARTINFO: %08x\n", rr );
			return -2;
		}
		else
		{
			if( iss->target_chip->protocol == PROTOCOL_UNSUPPORTED )
			{
				fprintf( stderr, "Detected %s chip, but it's not supported yet. Aborting\n", iss->target_chip->name_str );
				return -3;
			}

			if( iss->target_chip_type == CHIP_CH570 )
			{
				uint32_t options;
				MCF.ReadWord( dev, 0x40001058, &options );
				if( (options&0x800000) || (options&0x200000) ) read_protection = 1;
			}
			else if( read_protection == 0 )
			{
				uint32_t one;
				int two;
				MCF.WriteReg32( dev, DMDATA0, 0x4002201c );
				MCF.WriteReg32( dev, DMCOMMAND, 0x00271008 ); // Copy data to x8, and execute.
				MCF.WaitForDoneOp( dev, 1 );
				MCF.WriteReg32( dev, DMCOMMAND, 0x00221008 ); // Copy data from x8.
				MCF.ReadReg32( dev, DMDATA0, &one );
				MCF.WriteReg32( dev, DMDATA0, 0x40022020 );
				MCF.WriteReg32( dev, DMCOMMAND, 0x00271008 ); // Copy data to x8, and execute.
				MCF.WaitForDoneOp( dev, 1 );
				MCF.WriteReg32( dev, DMCOMMAND, 0x00221008 ); // Copy data from x8.
				MCF.ReadReg32( dev, DMDATA0, (uint32_t*)&two );
				
				if( (one & 2) || two != -1 ) read_protection = 1;
			}
			
			iss->target_chip_type = iss->target_chip->family_id;
			if( iss->flash_size == 0 ) iss->flash_size = iss->target_chip->flash_size;
			iss->ram_base = iss->target_chip->ram_base;
			iss->ram_size = iss->target_chip->ram_size;
			iss->sector_size = iss->target_chip->sector_size;
			iss->nr_registers_for_debug = 32; // Maybe add a core type variable to RiscVChip_s?
			if( iss->target_chip_type == CHIP_CH32V00x || 
				iss->target_chip_type == CHIP_CH32V003 ||  
				iss->target_chip_type == CHIP_CH641 )
			{
				iss->nr_registers_for_debug = 16;
			}
			if( iss->target_chip->protocol == PROTOCOL_CH5xx )
			{
				MCF.ReadBinaryBlob = CH5xxReadBinaryBlob;
				MCF.WriteBinaryBlob = CH5xxWriteBinaryBlob;
				MCF.Erase = CH5xxErase;
				MCF.SetClock = CH5xxSetClock;
				MCF.GetUUID = CH5xxReadUUID;
				MCF.ConfigureNRSTAsGPIO = CH5xxConfigureNRSTAsGPIO;
				if( iss->target_chip_type == CHIP_CH570 ) MCF.ConfigureReadProtection = DefaultConfigureReadProtection;
			}

			uint8_t * part_type = (uint8_t*)&iss->target_chip_id;
			uint8_t uuid[8];
			if( MCF.GetUUID( dev, uuid ) ) fprintf( stderr, "Couldn't read UUID\n" );
			fprintf( stderr, "Detected %s\n", iss->target_chip->name_str );
			fprintf( stderr, "Flash Storage: %d kB\n", iss->flash_size/1024 );
			fprintf( stderr, "Part UUID: %02x-%02x-%02x-%02x-%02x-%02x-%02x-%02x\n", uuid[0], uuid[1], uuid[2], uuid[3], uuid[4], uuid[5], uuid[6], uuid[7] );
			fprintf( stderr, "Part Type: %02x-%02x-%02x-%02x\n", part_type[3], part_type[2], part_type[1], part_type[0] );
			fprintf( stderr, "Read protection: %s\n", (read_protection > 0)?"enabled":"disabled" );
		}
		// Cleanup
		MCF.WriteReg32( dev, DMDATA0, old_x8 );
		MCF.WriteReg32( dev, DMCOMMAND, 0x00231008 ); // Copy data to x8
		MCF.WriteReg32( dev, DMDATA0, old_data0 );

		iss->statetag = STTAG( "XXXX" );
	}

	return 0;
}

static void StaticUpdatePROGBUFRegs( void * dev )
{
	struct InternalState * iss = (struct InternalState*)(((struct ProgrammerStructBase*)dev)->internal);
	uint32_t rr;
	if( MCF.ReadReg32( dev, DMHARTINFO, &rr ) )
	{
		fprintf( stderr, "Error: Could not get hart info.\n" );
		return;
	}

		int ret = 0;
		if( iss->target_chip == NULL )
		{
			ret = MCF.DetermineChipType( dev );
			if( ret ) return;
		}

	uint32_t data0offset = 0xe0000000 | ( rr & 0x7ff );

	// Putting DATA0's location into x10, and DATA1's location into x11 is universal for all continued code.
	MCF.WriteReg32( dev, DMABSTRACTAUTO, 0x00000000 ); // Disable Autoexec.
	MCF.WriteReg32( dev, DMDATA0, data0offset );       // DATA0's location in memory.
	MCF.WriteReg32( dev, DMCOMMAND, 0x0023100a );      // Copy data to x10
	MCF.WriteReg32( dev, DMDATA0, data0offset + 4 );   // DATA1's location in memory.
	MCF.WriteReg32( dev, DMCOMMAND, 0x0023100b );      // Copy data to x11
	MCF.WriteReg32( dev, DMDATA0, 0x4002200c );        // FLASH->STATR, add 4 to get FLASH->CTLR
	MCF.WriteReg32( dev, DMCOMMAND, 0x0023100c );      // Copy data to x12

	// v003 requires bufload every word.
	// x035 requires bufload every word in spite of what the datasheet says.
	// CR_PAGE_PG = FTPG = 0x00010000 | CR_BUF_LOAD = 0x00040000
	// We just don't do the write on the v20x/v30x.
	MCF.WriteReg32( dev, DMDATA0, 0x00010000|0x00040000 );
	MCF.WriteReg32( dev, DMCOMMAND, 0x0023100d );      // Copy data to x13
}

int InternalUnlockBootloader( void * dev )
{
	if( !MCF.WriteWord ) return -99;
	int ret = 0;
	uint32_t STATR;
	ret |= MCF.WriteWord( dev, 0x40022028, 0x45670123 ); //(FLASH_BOOT_MODEKEYP)
	ret |= MCF.WriteWord( dev, 0x40022028, 0xCDEF89AB ); //(FLASH_BOOT_MODEKEYP)
	ret |= MCF.ReadWord( dev, 0x4002200C, &STATR ); //(FLASH_OBTKEYR)
	if( ret )
	{
		fprintf( stderr, "Error operating with OBTKEYR\n" );
		return -1;
	}
	if( STATR & (1<<15) )
	{
		fprintf( stderr, "Error: Could not unlock boot section (%08x)\n", STATR );
	}
	STATR |= (1<<14); // Configure for boot-to-bootload.
	ret |= MCF.WriteWord( dev, 0x4002200C, STATR );
	ret |= MCF.ReadWord( dev, 0x4002200C, &STATR ); //(FLASH_OBTKEYR)

	// Need to flush state.
	struct InternalState * iss = (struct InternalState*)(((struct ProgrammerStructBase*)dev)->internal);
	iss->statetag = STTAG( "XXXX" );

	return ret;
}


int InternalIsMemoryErased( struct InternalState * iss, uint32_t address )
{
	if(( address & 0xff000000 ) != 0x08000000 ) return 0;
	int sector = (address & 0xffffff) / iss->sector_size;
	if( sector >= MAX_FLASH_SECTORS )
		return 0;
	else
		return iss->flash_sector_status[sector];
}

void InternalMarkMemoryNotErased( struct InternalState * iss, uint32_t address )
{
	if(( address & 0xff000000 ) != 0x08000000 ) return;
	int sector = (address & 0xffffff) / iss->sector_size;
	if( sector < MAX_FLASH_SECTORS )
		iss->flash_sector_status[sector] = 0;
}

static int DefaultWriteHalfWord( void * dev, uint32_t address_to_write, uint16_t data )
{
	int ret = 0;
	struct InternalState * iss = (struct InternalState*)(((struct ProgrammerStructBase*)dev)->internal);
	if( MCF.VoidHighLevelState ) MCF.VoidHighLevelState( dev );
	iss->statetag = STTAG( "XXXX" );

	MCF.WriteReg32( dev, DMABSTRACTAUTO, 0x00000000 ); // Disable Autoexec.

	// Different address, so we don't need to re-write all the program regs.
	// sh x8,0(x9)  // Write to the address.
	MCF.WriteReg32( dev, DMPROGBUF0, 0x00849023 );
	MCF.WriteReg32( dev, DMPROGBUF1, 0x00100073 ); // c.ebreak

	MCF.WriteReg32( dev, DMDATA0, address_to_write );
	MCF.WriteReg32( dev, DMCOMMAND, 0x00231009 ); // Copy data to x9
	MCF.WriteReg32( dev, DMDATA0, data );
	MCF.WriteReg32( dev, DMCOMMAND, 0x00271008 ); // Copy data to x8, and execute program.

