root643/unsolo-key/ch32fun/minichlink/minichlink.c
	// Special: For user data, need to write to it very carefully.
	if( address_to_write > 0x1ffff7c0 && address_to_write < 0x20000000 )
	{
		if( !MCF.WriteHalfWord )
		{
			fprintf( stderr, "Error: to write this type of memory, half-word-writing is required\n" );
			return -5;
		}

		uint32_t base = address_to_write & 0xffffffc0;
		uint8_t block[64];

		if( base != ((address_to_write+blob_size-1) & 0xffffffc0) )
		{
			fprintf( stderr, "Error: You cannot write across a 64-byte boundary when writing to option bytes\n" );
			return -9;
		}

		MCF.ReadBinaryBlob( dev, base, 64, block );

		uint32_t offset = address_to_write - base;
		memcpy( block + offset, blob, blob_size );

		uint32_t temp;
		MCF.ReadWord( dev, 0x4002200c, &temp );
		//STATR & BOOT only exists on the 003 and x03x
		// No issue if we force an unlock anyway.
		//if( temp & 0x8000 )
		{
			MCF.WriteWord( dev, 0x40022004, 0x45670123 ); // KEYR
			MCF.WriteWord( dev, 0x40022004, 0xCDEF89AB );

			// These registers are not on or required on the v20x / v30x, but no harm in writing.
			MCF.WriteWord( dev, 0x40022008, 0x45670123 ); // OBWRE
			MCF.WriteWord( dev, 0x40022008, 0xCDEF89AB );
			MCF.WriteWord( dev, 0x40022028, 0x45670123 ); //(FLASH_BOOT_MODEKEYP)
			MCF.WriteWord( dev, 0x40022028, 0xCDEF89AB ); //(FLASH_BOOT_MODEKEYP)
		}

		MCF.ReadWord( dev, 0x4002200c, &temp );
		if( temp & 0x8000 )
		{
			fprintf( stderr, "Error: Critical memory zone is still locked out\n" );
		}
		if( MCF.WaitForFlash ) MCF.WaitForFlash( dev );

		MCF.ReadWord( dev, (intptr_t)&FLASH->CTLR, &temp );

		if( !(temp & (1<<9)) ) // Check OBWRE
		{
			fprintf( stderr, "Error: Option Byte Unlock Failed (FLASH_CTRL=%08x)\n", temp );
		}

		// Perform erase.
		MCF.WriteWord( dev, (intptr_t)&FLASH->CTLR, FLASH_CTLR_OPTER | FLASH_CTLR_OPTWRE );
		MCF.WriteWord( dev, (intptr_t)&FLASH->CTLR, FLASH_CTLR_OPTER | FLASH_CTLR_OPTWRE | FLASH_CTLR_STRT );

		if( MCF.WaitForFlash ) MCF.WaitForFlash( dev );

		MCF.ReadWord( dev, 0x4002200c, &temp );
		if( temp & 0x10 )
		{
			fprintf( stderr, "WRPTRERR is set.  Write failed\n" );
			return -9;
		}

		int i;
		for( i = 0; i < 8; i++ )
		{
			// OBPG = FLASH_CTLR_OPTPG
			MCF.WriteWord( dev, (intptr_t)&FLASH->CTLR, FLASH_CTLR_OPTPG | FLASH_CTLR_OPTWRE );
			MCF.WriteWord( dev, (intptr_t)&FLASH->CTLR, FLASH_CTLR_OPTPG | FLASH_CTLR_STRT | FLASH_CTLR_OPTWRE );
			uint32_t writeaddy = i*2+base;
			uint16_t writeword = block[i*2+0] | (block[i*2+1]<<8);
			MCF.WriteHalfWord( dev, writeaddy, writeword );
			if( MCF.WaitForFlash ) MCF.WaitForFlash( dev );
			uint16_t verify = 0;
			MCF.ReadHalfWord( dev, writeaddy, &verify );
			if( verify != writeword )
			{
				fprintf( stderr, "Warning when writing option bytes at %08x, %04x != %04x\n", writeaddy, writeword, verify );
			}
			MCF.ReadWord( dev, 0x4002200c, &temp );
			if( temp & 0x10 )
			{
				fprintf( stderr, "WRPTRERR is set.  Write failed\n" );
				return -9;
			}
		}
		// Turn off OPTPG, OPTWRE.
		MCF.WriteWord( dev, (intptr_t)&FLASH->CTLR, 0 );
		if( MCF.WaitForFlash ) MCF.WaitForFlash( dev );

		return 0;
	}

	int sectorsize = iss->sector_size;
	int blocks_per_sector = sectorsize / 64;
	int sectorsizemask = sectorsize-1;

	// Regardless of sector size, allow block write to do its thing if it can.
	if( is_flash && MCF.BlockWrite64 && ( address_to_write & sectorsizemask ) == 0 &&
	    ( blob_size & sectorsizemask ) == 0  && iss->target_chip_type != CHIP_CH32V10x )
	{
		int i, j;
		for( i = 0; i < blob_size; )
		{
			for( j = 0; j < blocks_per_sector; j++ )
			{
				// When doing block writes, you MUST write a full sector.
				ret = MCF.BlockWrite64( dev, address_to_write + i, blob + i );
				i += 64;
				if( ret )
				{
					fprintf( stderr, "Error writing block at memory %08x / Error: %d\n", address_to_write, ret );
					return ret;
				}
			}
		}
		return 0;
	}

	uint8_t tempblock[sectorsize];
	int sblock =  address_to_write / sectorsize;
	int eblock = ( address_to_write + blob_size + (sectorsize-1) ) / sectorsize;
	int b;
	int rsofar = 0;
	// For now this is only for v20x/v30x
	uint32_t write_cmd = CR_PAGE_PG;
	uint32_t page_cmd = (1<<21);
	int skip_erase = 0;
	if( (iss->target_chip_type == CHIP_CH32V20x || iss->target_chip_type == CHIP_CH32V30x) && iss->current_area == BOOTLOADER_AREA )
	{
		write_cmd |= (1<<29); // Secrep bit for flashing boot area
		page_cmd |= (1<<29); // Secrep bit for flashing boot area
		skip_erase = 1;
	}

	for( b = sblock; b < eblock; b++ )
	{
		int offset_in_block = address_to_write - (b * sectorsize);
		if( offset_in_block < 0 ) offset_in_block = 0;
		int end_o_plus_one_in_block = ( address_to_write + blob_size ) - (b*sectorsize);
		if( end_o_plus_one_in_block > sectorsize ) end_o_plus_one_in_block = sectorsize;
		int	base = b * sectorsize;

		if( offset_in_block == 0 && end_o_plus_one_in_block == sectorsize )
		{
			if( MCF.BlockWrite64 && iss->target_chip_type != CHIP_CH32V10x)
			{
				int i;
				for( i = 0; i < sectorsize/64; i++ )
				{
					ret = MCF.BlockWrite64( dev, base + i*64, blob + rsofar+i*64 );
					if( ret )
					{
						fprintf( stderr, "Error writing block at memory %08x (error = %d)\n", base, ret );
						return ret;
					}
				}
				rsofar += sectorsize;
			}
			else 					// Block Write not avaialble
			{
				if( is_flash )
				{
					if( !skip_erase && !InternalIsMemoryErased( iss, base ) )
						MCF.Erase( dev, base, sectorsize, 0 );
					if( iss->target_chip_type != CHIP_CH32V20x && iss->target_chip_type != CHIP_CH32V30x && iss->target_chip_type != CHIP_CH32H41x )
					{
						// V003, x035, maybe more.
						MCF.WriteWord( dev, (intptr_t)&FLASH->CTLR, CR_PAGE_PG ); // THIS IS REQUIRED, (intptr_t)&FLASH->CTLR = 0x40022010
						MCF.WriteWord( dev, (intptr_t)&FLASH->CTLR, CR_BUF_RST | CR_PAGE_PG );  // (intptr_t)&FLASH->CTLR = 0x40022010
					}
					else
					{
						// No bufrst on v20x, v30x
						if( MCF.WaitForFlash ) MCF.WaitForFlash( dev );
						MCF.WriteWord( dev, (intptr_t)&FLASH->CTLR, write_cmd ); // THIS IS REQUIRED, (intptr_t)&FLASH->CTLR = 0x40022010
						//FTPG ==  CR_PAGE_PG   == ((uint32_t)0x00010000)
					}
					if( MCF.WaitForFlash ) MCF.WaitForFlash( dev );
				}

				int j;

