root643/unsolo-key/ch32fun/minichlink/minichlink.c
				for( j = 0; j < sectorsize/4; j++ )
				{
					uint32_t writeword;
					memcpy( &writeword, blob + rsofar, 4 );
					// WARNING: Just so you know, this is ACTUALLY doing the write AND if writing to flash, doing the following:
					// FLASH->CTLR = CR_PAGE_PG | FLASH_CTLR_BUF_LOAD AFTER it does the write.  THIS IS REQUIRED on the 003.
					if( is_flash && iss->target_chip_type == CHIP_CH32V10x && !((j+1)&3) )
					{
						// Signal to WriteWord that we need to do a buffer load
						MCF.WriteReg32( dev, DMDATA0, 1 );
						MCF.WriteReg32( dev, DMCOMMAND, 0x0023100f );
					}
					ret = MCF.WriteWord( dev, j*4+base, writeword );
					if( ret )
					{
						fprintf( stderr, "Error writing block at memory %08x (error = %d)\n", j*4+base, ret );
						return ret;
					}
					// On the v2xx, v3xx, you also need to make sure FLASH->STATR & 2 is not set.  This is only an issue when running locally.

					rsofar += 4;
				}

				if( is_flash )
				{
					if( iss->target_chip_type == CHIP_CH32V20x || iss->target_chip_type == CHIP_CH32V30x || iss->target_chip_type == CHIP_CH32H41x )
					{
						MCF.WriteWord( dev, (intptr_t)&FLASH->CTLR, page_cmd ); // Page Start
					}
					else
					{
						MCF.WriteWord( dev, (intptr_t)&FLASH->ADDR, base );  //0x40022014 -> FLASH->ADDR
						if( MCF.PrepForLongOp ) MCF.PrepForLongOp( dev );  // Give the programmer a headsup this next operation could take a while.
						MCF.WriteWord( dev, (intptr_t)&FLASH->CTLR, CR_PAGE_PG|CR_STRT_Set ); // 0x40022010 -> FLASH->CTLR
					}
					if( MCF.WaitForFlash ) MCF.WaitForFlash( dev );
					InternalMarkMemoryNotErased( iss, base );
				}
			}
		}
		else
		{
			//Ok, we have to do something wacky.
			if( is_flash )
			{
				MCF.ReadBinaryBlob( dev, base, sectorsize, tempblock );

				// Permute tempblock
				int tocopy = end_o_plus_one_in_block - offset_in_block;
				memcpy( tempblock + offset_in_block, blob + rsofar, tocopy );
				rsofar += tocopy;

				if( MCF.BlockWrite64 ) 
				{
					int i;
					for( i = 0; i < sectorsize/64; i++ )
					{
						ret = MCF.BlockWrite64( dev, base+i*64, tempblock+i*64 );
						if( ret )
						{
							fprintf( stderr, "Error writing block at memory %08x (error = %d)\n", base+i*64, ret );
							return ret;
						}
					}
				}
				else
				{
					if( !InternalIsMemoryErased( iss, base ) ) MCF.Erase( dev, base, sectorsize, 0 );

					if( iss->target_chip_type != CHIP_CH32V20x && iss->target_chip_type != CHIP_CH32V30x && iss->target_chip_type != CHIP_CH32H41x )
					{
						// V003, x035, maybe more.
						MCF.WriteWord( dev, (intptr_t)&FLASH->CTLR, CR_PAGE_PG ); // THIS IS REQUIRED, (intptr_t)&FLASH->CTLR = 0x40022010
						MCF.WriteWord( dev, (intptr_t)&FLASH->CTLR, CR_BUF_RST | CR_PAGE_PG );  // (intptr_t)&FLASH->CTLR = 0x40022010
					}
					else
					{
						// No bufrst on v20x, v30x
						if( MCF.WaitForFlash ) MCF.WaitForFlash( dev );
						MCF.WriteWord( dev, (intptr_t)&FLASH->CTLR, write_cmd ); // THIS IS REQUIRED, (intptr_t)&FLASH->CTLR = 0x40022010
						//FTPG ==  CR_PAGE_PG   == ((uint32_t)0x00010000)
					}
					if( MCF.WaitForFlash ) MCF.WaitForFlash( dev );

					int j;
					for( j = 0; j < sectorsize/4; j++ )
					{
						// WARNING: Just so you know, this is ACTUALLY doing the write AND if writing to flash, doing the following:
						// FLASH->CTLR = CR_PAGE_PG | FLASH_CTLR_BUF_LOAD AFTER it does the write.  THIS IS REQUIRED on the 003
						if( iss->target_chip_type == CHIP_CH32V10x && !((j+1)&3) )
						{
							// Signal to WriteWord that we need to do a buffer load
							MCF.WriteReg32( dev, DMDATA0, 1 );
							MCF.WriteReg32( dev, DMCOMMAND, 0x0023100f );
						}
						ret = MCF.WriteWord( dev, j*4+base, *(uint32_t*)(tempblock + j * 4) );
						if( ret )
						{
							fprintf( stderr, "Error writing block at memory %08x (error = %d)\n", j*4+base, ret );
							return ret;
						}
						// On the v2xx, v3xx, you also need to make sure FLASH->STATR & 2 is not set.  This is only an issue when running locally.
					}

					if( iss->target_chip_type == CHIP_CH32V20x || iss->target_chip_type == CHIP_CH32V30x || iss->target_chip_type == CHIP_CH32H41x )
					{
						MCF.WriteWord( dev, (intptr_t)&FLASH->CTLR, page_cmd ); // Page Start
					}
					else
					{
						MCF.WriteWord( dev, (intptr_t)&FLASH->ADDR, base );  //0x40022014 -> FLASH->ADDR
						MCF.WriteWord( dev, (intptr_t)&FLASH->CTLR, CR_PAGE_PG|CR_STRT_Set ); // 0x40022010 -> FLASH->CTLR
					}
					if( MCF.WaitForFlash ) MCF.WaitForFlash( dev );
					InternalMarkMemoryNotErased( iss, base );
				}
				if( MCF.WaitForFlash && MCF.WaitForFlash( dev ) ) goto timedout;
			}
			else
			{
				// Accessing RAM.  Be careful to only do the needed operations.
				int j;
				for( j = 0; j < sectorsize; j++ )
				{
					uint32_t taddy = j*4;
					if( offset_in_block <= taddy && end_o_plus_one_in_block >= taddy + 4 )
					{
						MCF.WriteWord( dev, taddy + base, *(uint32_t*)(blob + rsofar) );
						rsofar += 4;
					}
					else if( ( offset_in_block & 1 ) || ( end_o_plus_one_in_block & 1 ) )
					{
						// Bytes only.
						int j;
						for( j = 0; j < 4; j++ )
						{
							if( taddy >= offset_in_block && taddy < end_o_plus_one_in_block )
							{
								ret = MCF.WriteByte( dev, taddy + base, *(uint32_t*)(blob + rsofar) );
								if( ret )
								{
									fprintf( stderr, "Error writing block at memory %08x (error = %d)\n", taddy + base, ret );
									return ret;
								}
								rsofar ++;
							}
							taddy++;
						}
					}
					else
					{
						// Half-words
						int j;
						for( j = 0; j < 4; j+=2 )
						{
							if( taddy >= offset_in_block && taddy < end_o_plus_one_in_block )
							{
								ret = MCF.WriteHalfWord( dev, taddy + base, *(uint32_t*)(blob + rsofar) );
								if( ret )
								{
									fprintf( stderr, "Error writing block at memory %08x (error = %d)\n", taddy + base, ret );
									return ret;
								}
								rsofar +=2;
							}
							taddy+=2;
						}
					}
				}
			}
		}
	}

