root643/unsolo-key/ch32fun/minichlink/minichlink.c
		InternalUnlockFlash(dev, iss);

		const uint8_t * option_data = 
			(iss->target_chip_type == CHIP_CH32V003 || iss->target_chip_type == CHIP_CH32V00x
			|| iss->target_chip_type == CHIP_CH32X03x || iss->target_chip_type == CHIP_CH32L103
			|| iss->target_chip_type == CHIP_CH641 || iss->target_chip_type == CHIP_CH643) ?
			option_data_003_x03x : option_data_20x_30x;

		DefaultWriteBinaryBlob(dev, 0x1ffff800, 16, option_data );

		MCF.DelayUS( dev, 20000 );

		MCF.Erase( dev, 0, 0, 1);
		MCF.FlushLLCommands( dev );
	}
	else if ( iss->target_chip->protocol == PROTOCOL_CH5xx )
	{
		CH5xxErase( dev, 0, 0, 1 );
	}
	return -5;
}

int DefaultConfigureNRSTAsGPIO( void * dev, int one_if_yes_gpio )
{
	fprintf( stderr, "Error: DefaultConfigureNRSTAsGPIO does not work via the programmer here.  Please see the demo \"optionbytes\"\n" );
	return -5;
}

int DefaultConfigureReadProtection( void * dev, int one_if_yes_protect )
{
	struct InternalState * iss = (struct InternalState*)(((struct ProgrammerStructBase*)dev)->internal);
	if( iss->target_chip_type == CHIP_CH570 && one_if_yes_protect == 0 )
	{
		fprintf( stderr, "Disabling protection on CH570/2\n" );
		ch570_disable_read_protection( dev );
	}
	else
	{
		fprintf( stderr, "Error: DefaultConfigureReadProtection does not work via the programmer here.  Please see the demo \"optionbytes\"\n" );
		return -5;
	}
	return 0;
}

int DefaultEnableDebug( void * dev, uint8_t disable )
{
	fprintf( stderr, "Error: This is only possibe using ISP mode on some CH5xx chips.\n" );
	return -5;
}

int DefaultPrintChipInfo( void * dev )
{
	struct InternalState * iss = (struct InternalState*)(((struct ProgrammerStructBase*)dev)->internal);
	int ret = 0;
	if( iss->target_chip == NULL)
	{
		ret = MCF.DetermineChipType( dev );
		if( ret ) return ret;
	}

	uint32_t reg;
	MCF.HaltMode( dev, HALT_MODE_HALT_BUT_NO_RESET );
	if( iss->target_chip->protocol == PROTOCOL_DEFAULT )
	{
		if( MCF.ReadWord( dev, 0x1FFFF800, &reg ) ) goto fail;
		printf( "USER/RDPR  : %04x/%04x\n", reg>>16, reg&0xFFFF );
		if( MCF.ReadWord( dev, 0x1FFFF804, &reg ) ) goto fail;
		printf( "DATA1/DATA0: %04x/%04x\n", reg>>16, reg&0xFFFF );
		if( MCF.ReadWord( dev, 0x1FFFF808, &reg ) ) goto fail;
		printf( "WRPR1/WRPR0: %04x/%04x\n", reg>>16, reg&0xFFFF );
		if( MCF.ReadWord( dev, 0x1FFFF80c, &reg ) ) goto fail;
		printf( "WRPR3/WRPR2: %04x/%04x\n", reg>>16, reg&0xFFFF );
		// if( MCF.ReadWord( dev, 0x1FFFF7E0, &reg ) ) goto fail;
		// printf( "Flash Size: %d kB\n", (reg&0xffff) );
		if( MCF.ReadWord( dev, 0x1FFFF7E8, &reg ) ) goto fail;
		printf( "R32_ESIG_UNIID1: %08x\n", reg );
		if( MCF.ReadWord( dev, 0x1FFFF7EC, &reg ) ) goto fail;
		printf( "R32_ESIG_UNIID2: %08x\n", reg );
		if( MCF.ReadWord( dev, 0x1FFFF7F0, &reg ) ) goto fail;
		printf( "R32_ESIG_UNIID3: %08x\n", reg );
		return 0;
	}
	else if( iss->target_chip->protocol == PROTOCOL_CH5xx )
	{
		if ( CH5xxPrintInfo( dev ) ) goto fail;
		return 0;
	}
fail:
	fprintf( stderr, "Error: Failed to get chip details\n");
	return -11;
}

int DefaultVoidHighLevelState( void * dev )
{
	struct InternalState * iss = (struct InternalState*)(((struct ProgrammerStructBase*)dev)->internal);
	iss->statetag = STTAG( "VOID" );
	return 0;
}

int DefaultDelayUS( void * dev, int us )
{
#if defined(WINDOWS) || defined(WIN32) || defined(_WIN32)
	Sleep( (us+9999) / 1000 );
#else
	usleep( us );
#endif
	return 0;
}

static int DefaultSetClock( void * dev, uint32_t clock )
{
  fprintf( stderr, "Will set clock here, when implemented\n" );
  return 0;
}

int SetupAutomaticHighLevelFunctions( void * dev )
{
	// Will populate high-level functions from low-level functions.
	if( MCF.WriteReg32 == 0 && MCF.ReadReg32 == 0 && MCF.WriteWord == 0 ) return -5;

	// Else, TODO: Build the high level functions from low level functions.
	// If a high-level function alrady exists, don't override.

	if( !MCF.SetupInterface )
		MCF.SetupInterface = DefaultSetupInterface;
	if( !MCF.DetermineChipType )
		MCF.DetermineChipType = DefaultDetermineChipType;
	if( !MCF.WriteBinaryBlob )
		MCF.WriteBinaryBlob = DefaultWriteBinaryBlob;
	if( !MCF.ReadBinaryBlob )
		MCF.ReadBinaryBlob = DefaultReadBinaryBlob;
	if( !MCF.WriteWord )
		MCF.WriteWord = DefaultWriteWord;
	if( !MCF.WriteHalfWord )
		MCF.WriteHalfWord = DefaultWriteHalfWord;
	if( !MCF.WriteByte )
		MCF.WriteByte = DefaultWriteByte;
	if( !MCF.ReadCPURegister )
		MCF.ReadCPURegister = DefaultReadCPURegister;
	if( !MCF.WriteCPURegister )
		MCF.WriteCPURegister = DefaultWriteCPURegister;
	if( !MCF.WriteAllCPURegisters )
		MCF.WriteAllCPURegisters = DefaultWriteAllCPURegisters;
	if( !MCF.ReadAllCPURegisters )
		MCF.ReadAllCPURegisters = DefaultReadAllCPURegisters;
	if( !MCF.SetEnableBreakpoints )
		MCF.SetEnableBreakpoints = DefaultSetEnableBreakpoints;
	if( !MCF.ReadWord )
		MCF.ReadWord = DefaultReadWord;
	if( !MCF.ReadHalfWord )
		MCF.ReadHalfWord = DefaultReadHalfWord;
	if( !MCF.ReadByte )
		MCF.ReadByte = DefaultReadByte;
	if( !MCF.Erase )
		MCF.Erase = DefaultErase;
	if( !MCF.HaltMode )
		MCF.HaltMode = DefaultHaltMode;
	if( !MCF.SetSplit )
		MCF.SetSplit = DefaultSetSplit;
	if( !MCF.PollTerminal )
		MCF.PollTerminal = DefaultPollTerminal;
	if( !MCF.WaitForFlash )
		MCF.WaitForFlash = DefaultWaitForFlash;
	if( !MCF.WaitForDoneOp )
		MCF.WaitForDoneOp = DefaultWaitForDoneOp;
	if( !MCF.PrintChipInfo )
		MCF.PrintChipInfo = DefaultPrintChipInfo;
	if( !MCF.Unbrick )
		MCF.Unbrick = DefaultUnbrick;
	if( !MCF.ConfigureNRSTAsGPIO )
		MCF.ConfigureNRSTAsGPIO = DefaultConfigureNRSTAsGPIO;
  if( !MCF.ConfigureReadProtection )
    MCF.ConfigureReadProtection = DefaultConfigureReadProtection;
	if( !MCF.VoidHighLevelState )
		MCF.VoidHighLevelState = DefaultVoidHighLevelState;
	if( !MCF.DelayUS )
		MCF.DelayUS = DefaultDelayUS;
	if( !MCF.GetUUID )
		MCF.GetUUID = DefaultGetUUID;
  if( !MCF.SetClock )
    MCF.SetClock = DefaultSetClock;
  if( !MCF.EnableDebug )
    MCF.EnableDebug = DefaultEnableDebug;

	return 0;
}




void TestFunction(void * dev )
{
	uint32_t rv;
	int r;
	MCF.WriteReg32( dev, DMCONTROL, 0x80000001 ); // Make the debug module work properly.
	MCF.WriteReg32( dev, DMCONTROL, 0x80000001 ); // Initiate a halt request.
	MCF.WriteReg32( dev, DMCONTROL, 0x00000001 ); // Clear Halt Request.

