root643/unsolo-key/ch32fun/minichlink/minichlink.c
	r = MCF.WriteWord( dev, 0x20000100, 0xdeadbeef );
	r = MCF.WriteWord( dev, 0x20000104, 0xcafed0de );
	r = MCF.WriteWord( dev, 0x20000108, 0x12345678 );
	r = MCF.WriteWord( dev, 0x20000108, 0x00b00d00 );
	r = MCF.WriteWord( dev, 0x20000104, 0x33334444 );

	r = MCF.ReadWord( dev, 0x20000100, &rv );
	printf( "**>>> %d %08x\n", r, rv );
	r = MCF.ReadWord( dev, 0x20000104, &rv );
	printf( "**>>> %d %08x\n", r, rv );
	r = MCF.ReadWord( dev, 0x20000108, &rv );
	printf( "**>>> %d %08x\n", r, rv );


	r = MCF.ReadWord( dev, 0x00000300, &rv );
	printf( "F %d %08x\n", r, rv );
	r = MCF.ReadWord( dev, 0x00000304, &rv );
	printf( "F %d %08x\n", r, rv );
	r = MCF.ReadWord( dev, 0x00000308, &rv );
	printf( "F %d %08x\n", r, rv );

	uint8_t buffer[256];
	int i;
	for( i = 0; i < 256; i++ ) buffer[i] = 0;
	MCF.WriteBinaryBlob( dev, 0x08000300, 256, buffer );
	MCF.ReadBinaryBlob( dev, 0x08000300, 256, buffer );
	for( i = 0; i < 256; i++ )
	{
		printf( "%02x ", buffer[i] );
		if( (i & 0xf) == 0xf ) printf( "\n" );
	}

	for( i = 0; i < 256; i++ ) buffer[i] = i;
	MCF.WriteBinaryBlob( dev, 0x08000300, 256, buffer );
	MCF.ReadBinaryBlob( dev, 0x08000300, 256, buffer );
	for( i = 0; i < 256; i++ )
	{
		printf( "%02x ", buffer[i] );
		if( (i & 0xf) == 0xf ) printf( "\n" );
	}
}

int DetectMemoryArea( void * dev, uint32_t address )
{
	struct InternalState * iss = (struct InternalState*)(((struct ProgrammerStructBase*)dev)->internal);
	int ret = 0;
	if( iss->target_chip == NULL)
	{
		ret = MCF.DetermineChipType( dev );
		if( ret ) return ret;
	}
	const struct RiscVChip_s * chip = iss->target_chip;
	if( !iss->debugger ) fprintf( stderr, "Detecting Memory Area\n" );
	else return 0;

	if( address < chip->flash_offset)
	{
		fprintf( stderr, "The starting address is lower than FLASH start. Aborting\n" );
		return -1;
	}
	if( address < chip->flash_offset + chip->flash_size )
	{
		iss->current_area = PROGRAM_AREA;
		return 0;
	}
	else if( chip->bootloader_size > 0 && 
					address >= chip->bootloader_offset &&
					address < chip->bootloader_offset + chip->bootloader_size )
	{
		iss->current_area = BOOTLOADER_AREA;
		return 0;
	}
	else if( chip->options_size > 0 && 
					address >= chip->options_offset &&
					address < chip->options_offset + chip->options_size )
	{
		iss->current_area = OPTIONS_AREA;
		return 0;
	}
	else if( chip->eeprom_size > 0 && 
					address >= chip->eeprom_offset &&
					address < chip->eeprom_offset + chip->eeprom_size )
	{
		iss->current_area = EEPROM_AREA;
		return 0;
	}
	else if( address >= chip->ram_base )
	{
		iss->current_area = RAM_AREA;
		return 0;
	}

	fprintf( stderr, "Something went wrong and we couldn't detect memory region\n" );
	return -2;
}

int CheckMemoryLocation( void * dev, enum MemoryArea area, uint32_t address, uint32_t length )
{
	struct InternalState * iss = (struct InternalState*)(((struct ProgrammerStructBase*)dev)->internal);
	int ret = 0;
	if( iss->target_chip == NULL)
	{
		ret = MCF.DetermineChipType( dev );
		if( ret ) return ret;
	}
	const struct RiscVChip_s * chip = iss->target_chip;

	if( area == DEFAULT_AREA )
	{
		if( iss->current_area == 0 ) DetectMemoryArea( dev, address );
		area = iss->current_area;
	}

	if( chip->protocol == PROTOCOL_UNSUPPORTED )
	{
		fprintf(stderr, "Flashing this MCU model is not yet supported in minichlink.\n");
		fprintf(stderr, "But you can still use other functions, like working with RAM, or debug registers.\n");
		return 0;
	}

	switch (area)
	{
	case DEFAULT_AREA:
		return 0;
	case PROGRAM_AREA:
		if( address >= chip->flash_offset &&
			  address < (chip->flash_offset + chip->flash_size) &&
			  (address + length) <= (chip->flash_offset + chip->flash_size) )
		{
			return 1;
		}
		break;
	case BOOTLOADER_AREA:
		if( chip->bootloader_size > 0 &&
			  address >= chip->bootloader_offset &&
			  address < chip->bootloader_offset + chip->bootloader_size &&
			  address + length <= chip->bootloader_offset + chip->bootloader_size )
		{
			return 1;
		}
		break;
	case OPTIONS_AREA:
		if( chip->options_size > 0 &&
			  address >= chip->options_offset &&
			  address < chip->options_offset + chip->options_size &&
			  address + length <= chip->options_offset + chip->options_size )
		{
			return 1;
		}
		break;
	case EEPROM_AREA:
		if( chip->eeprom_size > 0 &&
			  address >= chip->eeprom_offset &&
			  address < chip->eeprom_offset + chip->eeprom_size &&
			  address + length <= chip->eeprom_offset + chip->eeprom_size )
		{
			return 1;
		}
		break;
	case RAM_AREA:
		if( address >= chip->ram_base)
		{
			return 1;
		}
		break;
	}

	return 0;
}

static void readCSR( void * dev, uint32_t csr )
{
	MCF.HaltMode( dev, HALT_MODE_HALT_BUT_NO_RESET );

	// MCF.WriteReg32(dev, DMABSTRACTAUTO, 0x00000000); // Disable Autoexec.
	// MCF.WriteReg32(dev, DMPROGBUF0, 0x305022f3); // csrrs t0, mtvec, zero
	// MCF.WriteReg32(dev, DMPROGBUF1, 0x00100073); // ebreak

	// MCF.WriteReg32(dev, DMCOMMAND, 0x00271000); // Write execute.
	MCF.WriteReg32( dev, DMCOMMAND, 0x00220000 | csr ); // Read a0 into DATA0.
	uint32_t dmdata = 0;
	MCF.ReadReg32( dev, DMDATA0, &dmdata );
	fprintf( stderr, "Requested CSR: %08x = %08x\n", csr, dmdata );

	MCF.WriteReg32( dev, DMCONTROL, 0x40000001 );
	MCF.WriteReg32( dev, DMCONTROL, 0x40000001 );
}

static int DefaultRebootIntoBootloader( void * dev )
{
	struct InternalState * iss = (struct InternalState*)(((struct ProgrammerStructBase*)dev)->internal);
	int r;
	int max_timeout = 0;

	if( !MCF.Control3v3 && !MCF.Control5v )
	{
		fprintf( stderr, "This programming method doesn't have power controls.\n" );
		return -100;
	}

	if( iss->target_chip_type == CHIP_CH570 || iss->target_chip_type == CHIP_CH59x )
	{
		max_timeout = 500;
	}

	if( iss->target_chip_type != CHIP_CH570
		&& iss->target_chip_type != CHIP_CH585
		&& iss->target_chip_type != CHIP_CH59x )
	{
		printf( "Press and hold bootloader button. Then press enter to proceed\n");
		while( !IsKBHit() );
		ReadKBByte();
	}

	fprintf( stderr, "Entering Bootloader\n" );
	if( MCF.Control5v ) MCF.Control5v( dev, 0 );
	if( MCF.Control3v3 ) MCF.Control3v3( dev, 0 );

	MCF.DelayUS( dev, 60000 );
	MCF.DelayUS( dev, 60000 );
	MCF.DelayUS( dev, 60000 );
	MCF.DelayUS( dev, 60000 );
	MCF.DelayUS( dev, 60000 );
	MCF.FlushLLCommands( dev );
	if( MCF.ResetInterface && max_timeout == 0 ) MCF.ResetInterface( dev );
	if( MCF.Control5v ) MCF.Control5v( dev, 1 );
	if( MCF.Control3v3 ) MCF.Control3v3( dev, 1 );
	fprintf(stderr, "Connecting to the DM\n" );

	int timeout = 0;
	uint32_t ds = 0;
	for( timeout = 0; timeout < max_timeout; timeout++ )
	{
		MCF.DelayUS( dev, 10 );
		MCF.WriteReg32( dev, DMSHDWCFGR, 0x5aa50000 | (1<<10) ); // Shadow Config Reg
		MCF.WriteReg32( dev, DMCFGR, 0x5aa50000 | (1<<10) ); // CFGR (1<<10 == Allow output from slave)
		MCF.WriteReg32( dev, DMCONTROL, 0x80000001 ); // Make the debug module work properly.
		MCF.WriteReg32( dev, DMCONTROL, 0x80000001 ); // Initiate a halt request.
		MCF.WriteReg32( dev, DMCONTROL, 0x80000001 ); // No, really make sure.
		MCF.FlushLLCommands( dev );
		r = MCF.ReadReg32( dev, DMSTATUS, &ds );
		if( r )
		{
			fprintf( stderr, "\nError: Could not read DMSTATUS from programmers (%d)\n", r );
			continue;
		}
		MCF.FlushLLCommands( dev );
		if( ds != 0xffffffff && ds != 0x00000000 ) break;
		else fprintf( stderr, "." );
	}
	fprintf(stderr, "\n" );
	MCF.SetupInterface(dev);
	fprintf(stderr, "Connected\n" );
	if( iss->target_chip->protocol == PROTOCOL_CH5xx )
	{
		uint8_t info_reg = 0;
		r = MCF.ReadByte( dev, 0x40001045, &info_reg );
		// printf("R8_GLOB_CFG_INFO = %02x, BOOTLOADER_BIT = %d\n", info_reg, (info_reg & (1<<5)));
		if( !(info_reg & (1<<5)) || r ) {
			fprintf(stderr, "Failed to switch to bootloader\n");
			return -1;
		}
	}
	MCF.HaltMode = 0;
	printf( "Chip is halted in bootloader mode. Press enter to proceed\n");
	while(!IsKBHit());
	ReadKBByte();
  return 0;
}
